##
# Initially generated via `brew bundle dump --describe`, but then cleaned up manually.
##

# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"

###
# Basic Dependencies
###

# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Distributed revision control system
brew "git"

###
# Programming Environment
###
# Load/unload environment variables based on $PWD
brew "direnv"
# Add GitHub support to git on the command-line
brew "hub"
# Node.js
brew "node"
# Python version management
brew "pyenv"
brew "pyenv-virtualenv"

###
# Terminal Environment
###
# Code-search similar to ack
brew "the_silver_searcher"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# ZSH Theme
brew "powerlevel10k"

# Web browsers
cask "arc"
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Music streaming service
cask "spotify"
# Spotify and iTunes in the menu bar
cask "spotmenu"
# Application launcher and productivity software
cask "alfred"
# Menu bar icon organizer
cask "vanilla"
# Keyboard customizer
cask "karabiner-elements"
# Text editor
cask "macvim"

###
# App Store Apps
###
mas "OneTab", id: 1540160809
mas "PiPifier", id: 1160374471
mas "Refined GitHub", id: 1519867270
mas "Amphetamine", id: 937984704
mas "Moom", id: 419330170
