##
# Initially generated via `brew bundle dump --describe`, but then cleaned up manually.
##

# Taps
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/bundle"
tap "zero-sh/tap"

# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# Radically simple personal bootstrapping tool for macOS
brew "zero-sh/tap/zero"

###
# Basic Dependencies
###

# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Distributed revision control system
brew "git"

###
# Programming Environment
###
# Interpreted, interactive, object-oriented programming language
brew "python@3.8", link: true
# Load/unload environment variables based on $PWD
brew "direnv"
# Add GitHub support to git on the command-line
brew "hub"
# Ruby version manager (includes Ruby)
brew "rbenv"
# JavaScript package manager (includes Node)
brew "yarn"

###
# Terminal Environment
###
# Code-search similar to ack
brew "the_silver_searcher"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"


###
# Bonuses
###
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Remote terminal application
brew "mosh"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Library and executable for using citeproc with pandoc
brew "pandoc-citeproc"
# Download YouTube videos from the command-line
brew "youtube-dl"

###
# Mac Only
###
# GUI for vim, made for macOS
brew "macvim", link: false

# Password manager that keeps all passwords secure behind one password
cask "1password"
# Application launcher and productivity software
cask "alfred"
# Menu bar icon organizer
cask "bartender"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# Text editor
cask "macvim"
# Utility to resize and position application windows
cask "sizeup"
# Music streaming service
cask "spotify"
# Spotify and iTunes in the menu bar
cask "spotmenu"

###
# App Store Apps
###
mas "Amphetamine", id: 937984704
mas "Byword", id: 420212497
mas "Moom", id: 419330170
mas "OneTab", id: 1540160809
mas "PiPifier", id: 1160374471
mas "Refined GitHub", id: 1519867270
